Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t struct represents a bitmap layed out as expected by TS core.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.SizeConst
The fixed length of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.Array.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.Identifier
The identifier, usually set by TS core.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.ViewIdentifier
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.Width
The width.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.Height
The height.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.Array
The array of integers representing RGBA values (each 8 bits).

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.#ctor(System.Int32,System.Int32)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t struct.
height: The height of the bitmap.
width: The width of the bitmap.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.ToString
Returns a System.String representation of the current instance.
Returns:
A System.String representation of the current instance.